OdDAI.Schema.getComplexEntity(OdDAI.List&lt;OdDAI.Entity**&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a complex entity from the list of entities.
\param complexEntityList [in] A list of entities to create from.
\remarks
* The result is plain list of entities without supertypes.
* The associativity rule is valid for operation (A+B)+C=A+(B+C) and gets same result = A+B+C.

OdDAI.Schema.getSuperEntityCollection(OdSmartPtr&lt;OdDAI.Entity&gt;!System.Runtime.CompilerServices.IsConst,std.list&lt;OdSmartPtr&lt;OdDAI.Entity&gt;,std.allocator&lt;OdSmartPtr&lt;OdDAI.Entity&gt;&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the collection of supertypes starting from a specified entity definition.
The method fills a passed entity list and returns it to a calling subroutine.
\param targetEntity     [in]  A smart pointer to the starting entity definition.
\param collectionToFill [out] A placeholder for the supertypes collection.

OdDAI.Schema.namedType(OdAnsiString)
\details
Searches for an entity or type definition by its name.
\param typeName [in] An ANSI string that contains the entity name.
\returns A smart pointer to the named type of found entity or type definition. If the entity or type is not found, the method returns a NULL smart pointer.

OdDAI.Schema.complexEntities
\details
Retrieves a set of complex entity definitions of the schema.
\returns Returns a set of complex entity definitions of the schema.